### Explain dimension reduction in machine learning.

### Dimensionality Reduction in simple terms is reducing the large number of features to smaller number of features keeping the originality of data ,So that the dataset can give better results when fed into a machine learning model. We can perform below given steps to reduce the dimension(features) of dataset. 
### 1. Missing Values- If we find a feature with more mssing value we might drop that feature , so that it doesnt affect the model adversly.
###  2. Low variance- Many features in the dataset could be constant or with very less variation. Such features could be dropped.
### 3. High Correlation- If 2 input features are highly correlated then one feature could be dropped as both features would have same effect on the model.
### 4. Principal Component Analysis (PCA): In this technique, variables are transformed into a new set of variables, which are linear combination of original variables. This technique is used when trying to find meaning or relation between features is difficult. Or when the features are in count of 100s or 1000s. So we perform PCA as a result the overall number of features fed into the model reduces.
### On the whole we try to build a machine learning model with a right balance of features so that the performance of the model is not affected. Striking a balance is very important because more number of features could have a curse of dimensionality or else less number of features could underfit the model.

###  How can you handle duplicate values in a dataset for a variable in Python using pandas?

In [1]:
import pandas as pd

In [27]:
# Taking a example with few duplicate records
emp=pd.read_csv('Emp.csv')

In [28]:
emp

  Emp Name  Age    State
0     Anil   30      Kar
1    Sunil   20       UP
2      Nar   23       MP
3   Sundar   29    Delhi
4    Sunil   20       UP
5      Nar   23       MP
6     Anil   30  Haryana
7   Ananth   32     Maha
8    Ajith   27       UP

In [17]:
# to find duplicated values based on all columns
duplicate = emp[emp.duplicated()]
duplicate

  Emp Name  Age State
4    Sunil   20    UP
5      Nar   23    MP

###  Based on Name and AGE -- We find 3 values duplicate when we take only Name and Age. but previous case we get 2 values with all values in row duplicate

In [18]:

duplicate = emp[emp.duplicated(['Emp Name', 'Age'])] 
duplicate

  Emp Name  Age    State
4    Sunil   20       UP
5      Nar   23       MP
6     Anil   30  Haryana

In [30]:
# Keep the first value as unique and delete other all duplicate values in the dataset
emp_new=emp.drop_duplicates(keep='first') 
emp_new=emp_new.reset_index(drop=True)
emp_new

  Emp Name  Age    State
0     Anil   30      Kar
1    Sunil   20       UP
2      Nar   23       MP
3   Sundar   29    Delhi
4     Anil   30  Haryana
5   Ananth   32     Maha
6    Ajith   27       UP

### We can see only unique values in the dataset when we use drop duplicates,where 2 duplicate rows are dropped. We can specify which column combination also to drop duplicate rows

In [32]:
# We see 3 rows deleted 
emp_new=emp.drop_duplicates(subset=['Emp Name','Age'],keep='first') 
emp_new=emp_new.reset_index(drop=True)
emp_new

  Emp Name  Age  State
0     Anil   30    Kar
1    Sunil   20     UP
2      Nar   23     MP
3   Sundar   29  Delhi
4   Ananth   32   Maha
5    Ajith   27     UP